; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	infrared2 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation7 - direction
	Star5 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation6 - direction
	Star3 - direction
	Star2 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 image1)
	(have_image Phenomenon11 image1)
	(have_image Planet12 spectrograph0)
	(have_image Star13 image1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Star15 spectrograph0)
	(have_image Phenomenon16 infrared2)
	(have_image Phenomenon17 image1)
	(have_image Planet18 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation6 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 11
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon16 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 11
5. (take_image satellite1 phenomenon16 instrument2 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 11
7. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   goals met: 1 of 11
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 11
9. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 1 of 11
10. (take_image satellite1 phenomenon14 instrument2 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 2 of 11
11. (turn_to satellite0 phenomenon11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 11
12. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 3 of 11
13. (turn_to satellite0 phenomenon17 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 11
14. (take_image satellite0 phenomenon17 instrument0 image1)
   added: (have_image phenomenon17 image1)
   goals met: 4 of 11
15. (turn_to satellite0 star10 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star10)
   goals met: 4 of 11
16. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 5 of 11
17. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 5 of 11
18. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 6 of 11
19. (turn_to satellite0 phenomenon14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon14)
   goals met: 7 of 11
20. (turn_to satellite1 phenomenon9 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 11
21. (take_image satellite1 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 8 of 11
22. (turn_to satellite1 planet12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet12)
   goals met: 8 of 11
23. (take_image satellite1 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 9 of 11
24. (turn_to satellite1 planet18 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet18)
   goals met: 9 of 11
25. (take_image satellite1 planet18 instrument2 spectrograph0)
   added: (have_image planet18 spectrograph0)
   goals met: 10 of 11
26. (turn_to satellite1 star15 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star15)
   goals met: 10 of 11
27. (take_image satellite1 star15 instrument2 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 11 of 11
